In [27]:
import pandas as pd #import the pandas and aliasing as pd
import numpy as np
data = np.array(['a','b','c','d'])
s1 = pd.Series(data)
print(s1)
data = np.array([1,2,3,4])
s2 = pd.Series(data)
print(s2)

0    a
1    b
2    c
3    d
dtype: object
0    1
1    2
2    3
3    4
dtype: int32

## What are the results? What are the differences between s1 and s2?
s1 is an object , s2 is an int

In [26]:
print("Now, it is your turn to create an heterogeneously-typed series. \nFor example, [1,‘b’,3,‘d’]. What is a data type of the heterogeneously-typed series when you print out the created series?")
data = np.array([1,'b',3,'d'])
s3 = pd.Series(data)
print(s3)

Now, it is your turn to create an heterogeneously-typed series.
For example, [1,‘b’,3,‘d’]. What is a data type of the heterogeneously-typed series when you print out the created series?
0    1
1    b
2    3
3    d
dtype: object

In [71]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[0])
print("Exercise: Write a code to retrieve (show) only the first three elements in Series s.")
print(s[:3])

100    a
101    b
102    c
103    d
dtype: object
1
Exercise: Write a code to retrieve (show) only the first three elements in Series s.
a    1
b    2
c    3
dtype: int64

In [32]:
print("Exercise: Let try to use an index (e.g. ‘a’) to access the element in Series s, e.g. s[[‘a’]]")
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(s[['a']])
print(s[['a','c','d']])

Exercise: Let try to use an index (e.g. ‘a’) to access the element in Series s, e.g. s[[‘a’]]
a    1
dtype: int64
a    1
c    3
d    4
dtype: int64

In [16]:
import pandas as pd
df = pd.DataFrame()
print(df)
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)
data = [['Alex',10],['Bob',12],['Clarke',13]]
df2 = pd.DataFrame(data,columns=['Name','Age'])
print(df2)
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)

Empty DataFrame
Columns: []
Index: []
   0
0  1
1  2
2  3
3  4
4  5
     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [72]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

Notice that we have NaN, why? Ans: because one only have 3 element.but two have four

In [83]:
print("Exercise: now, this is your turn to create the following table as Dataframe and name this table as studentDF.")
c = {'Math' : pd.Series([90,10,34,23,43], index=[0,1,2,3,4]),
     'C_programming' : pd.Series([70,20,25,32,73], index=[0,1,2,3,4]),
     'Java' : pd.Series([50,41,67,34,23], index = [0,1,2,3,4]),
     'Web_programming' : pd.Series([55,66,23,76,67], index = [0,1,2,3,4])
    }
studentDF = pd.DataFrame(c)
studentDF

Exercise: now, this is your turn to create the following table as Dataframe and name this table as studentDF.

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67

In [84]:
studentDF[2:4]

   Math  C_programming  Java  Web_programming
2    34             25    67               23
3    23             32    34               76

In [85]:
print(studentDF.loc[0])

Math               90
C_programming      70
Java               50
Web_programming    55
Name: 0, dtype: int64

In [86]:
print(studentDF.loc[2])

Math               34
C_programming      25
Java               67
Web_programming    23
Name: 2, dtype: int64

In [87]:
print(studentDF.loc[0:2])

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23

In [88]:
print("Exercise: use append t add the following table to table studentDF that you have created in the previous exercise.")
df1 = pd.DataFrame([[59,37,84,82],[41,34,73,55]], columns = ['Math','C_programming','Java','Web_programming'],index = [5,6])
studentDF = studentDF.append(df1)
studentDF

Exercise: use append t add the following table to table studentDF that you have created in the previous exercise.

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82
6    41             34    73               55

In [89]:
print("Exercise: use drop function to remove the last row from table studentDF.")
studentDF = studentDF.drop(6)
studentDF

Exercise: use drop function to remove the last row from table studentDF.

   Math  C_programming  Java  Web_programming
0    90             70    50               55
1    10             20    41               66
2    34             25    67               23
3    23             32    34               76
4    43             73    23               67
5    59             37    84               82

In [91]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],
        'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df.sum()

Name    TomJackSteveRicky
Age                   133
dtype: object

In [92]:
print("Exercise: try to apply sum() with table studentDF. What is the result?")
studentDF.sum()

Exercise: try to apply sum() with table studentDF. What is the result?

Math               259
C_programming      257
Java               299
Web_programming    369
dtype: int64

In [93]:
print("Exercise: try to use axis attribute to change the orientation of the summation.")
studentDF.sum(axis = 1)

Exercise: try to use axis attribute to change the orientation of the summation.

0    265
1    137
2    149
3    165
4    206
5    262
dtype: int64

In [94]:
print("Exercise: use the above statistical functions on table studentDF, and see the results.")
studentDF.max()

Exercise: use the above statistical functions on table studentDF, and see the results.

Math               90
C_programming      73
Java               84
Web_programming    82
dtype: int64

In [95]:
studentDF.describe()

            Math  C_programming       Java  Web_programming
count   6.000000       6.000000   6.000000         6.000000
mean   43.166667      42.833333  49.833333        61.500000
std    28.407159      22.973173  22.409076        21.002381
min    10.000000      20.000000  23.000000        23.000000
25%    25.750000      26.750000  35.750000        57.750000
50%    38.500000      34.500000  45.500000        66.500000
75%    55.000000      61.750000  62.750000        73.750000
max    90.000000      73.000000  84.000000        82.000000

In [55]:
print("- What is the mean value of Math score? ANS:43.1667\n- What is the score at the third quartile of Java? ANS:62.750\n- What is the standard deviation of Web programming score? ANS:21.002381")

- What is the mean value of Math score? ANS:43.1667
- What is the score at the third quartile of Java? ANS:62.750
- What is the standard deviation of Web programming score? ANS:21.002381

In [96]:
studentDF = studentDF.reindex([0,1,2,3,4,5,6,7])
studentDF

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   NaN            NaN   NaN              NaN
7   NaN            NaN   NaN              NaN

In [57]:
print("How many NaN appearin table studentDF. ANS:8 NaN")

How many NaN appearin table studentDF. ANS:8 NaN

In [97]:
print("Exercise: use isnull() and notnull() with table studentDF and see the results")
studentDF.isnull()

Exercise: use isnull() and notnull() with table studentDF and see the results

    Math  C_programming   Java  Web_programming
0  False          False  False            False
1  False          False  False            False
2  False          False  False            False
3  False          False  False            False
4  False          False  False            False
5  False          False  False            False
6   True           True   True             True
7   True           True   True             True

In [98]:
studentDF.notnull()

    Math  C_programming   Java  Web_programming
0   True           True   True             True
1   True           True   True             True
2   True           True   True             True
3   True           True   True             True
4   True           True   True             True
5   True           True   True             True
6  False          False  False            False
7  False          False  False            False

In [99]:
s1 = studentDF
s2 = studentDF
s1 = s1.fillna(0)
s2 = s2.fillna(method='pad')
print(s1)
print(s2)
print("Exercise: What is the differences between s1 and s2.\ns1 fills NaN with 0, \ns2 fills NaN as with the last row")

   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6   0.0            0.0   0.0              0.0
7   0.0            0.0   0.0              0.0
   Math  C_programming  Java  Web_programming
0  90.0           70.0  50.0             55.0
1  10.0           20.0  41.0             66.0
2  34.0           25.0  67.0             23.0
3  23.0           32.0  34.0             76.0
4  43.0           73.0  23.0             67.0
5  59.0           37.0  84.0             82.0
6  59.0           37.0  84.0             82.0
7  59.0           37.0  84.0             82.0
Exercise: What is the differences between s1 and s2.
s1 fills NaN with 0,
s2 fills NaN as with the last row

In [100]:
left = pd.DataFrame({
        'id':[1,2,3,4,5],
        'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame({
        'id':[1,2,3,4,5],
        'subject_name':['Math','English','Social Science','Programming','Physics']})
print(left)
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id    subject_name
0   1            Math
1   2         English
2   3  Social Science
3   4     Programming
4   5         Physics

In [104]:
merged_table = pd.merge(left,right,on='id')
merged_table

   id    Name subject_id    subject_name
0   1    Alex       sub1            Math
1   2     Amy       sub2         English
2   3   Allen       sub4  Social Science
3   4   Alice       sub6     Programming
4   5  Ayoung       sub5         Physics

In [105]:
print("Exercise: create table section and create table student as the following. \nYou have to use merge() to join the section table with the student table below and name your table as score. \nNote that use id as a joining key")
left = pd.DataFrame({
        'id' :[0,1,2,3,4,5],
        'section' :['one','one','one','two','two','two']
})
right = pd.DataFrame({
        'id' :[0,1,2,3,4,5],
        'name' :['Mat','Mike','John','Peecha','Prabu','Bunchu'],
        'math' :[34,12,34,12,65,23],
        'english' :[23,13,51,62,12,42]
})
print(left)
print(right)

Exercise: create table section and create table student as the following.
You have to use merge() to join the section table with the student table below and name your table as score.
Note that use id as a joining key
   id section
0   0     one
1   1     one
2   2     one
3   3     two
4   4     two
5   5     two
   id    name  math  english
0   0     Mat    34       23
1   1    Mike    12       13
2   2    John    34       51
3   3  Peecha    12       62
4   4   Prabu    65       12
5   5  Bunchu    23       42

In [106]:
score = pd.merge(left,right,on='id')
score

   id section    name  math  english
0   0     one     Mat    34       23
1   1     one    Mike    12       13
2   2     one    John    34       51
3   3     two  Peecha    12       62
4   4     two   Prabu    65       12
5   5     two  Bunchu    23       42

In [107]:
score_sec = score.groupby('section')
score_sec.sum()

         id  math  english
section
one       3    80       87
two      12   100      116